## [terraform-starter](https://ojcorzog.app.spacelift.io/stack/terraform-starter/run/01GWNFHZ1GGMDMMV5ATAR5G1DK) plan logs

<details>
<summary>Click here to expand</summary>

```
[01GVZNDB5B7KMEDC2GG5A0FEY3] Planning changes with 0 custom hooks...
random_password.context-password: Refreshing state... [id=none]
random_password.stack-password: Refreshing state... [id=none]
spacelift_policy.plan: Refreshing state... [id=enforce-password-strength]
spacelift_policy.access: Refreshing state... [id=all-of-engineering-gets-read-access]
spacelift_context.managed: Refreshing state... [id=managed-context]
spacelift_policy.login: Refreshing state... [id=devops-are-admins]
spacelift_policy.push: Refreshing state... [id=ignore-commits-outside-the-project-root]
spacelift_policy.comments_deploy: Refreshing state... [id=deploy-from-pr-comments]
data.spacelift_ips.ips: Reading...
spacelift_policy.task: Refreshing state... [id=allow-only-safe-commands]
data.spacelift_current_stack.this: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=terraform-starter]
spacelift_policy.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency]
spacelift_stack.managed: Refreshing state... [id=managed-stack]
data.spacelift_ips.ips: Read complete after 0s [id=spacelift-ips]
spacelift_environment_variable.context-plaintext: Refreshing state... [id=context/managed-context/CONTEXT_PUBLIC]
spacelift_environment_variable.context-writeonly: Refreshing state... [id=context/managed-context/CONTEXT_SECRET]
spacelift_mounted_file.context-secret-file: Refreshing state... [id=context/managed-context/context-secret-password.json]
spacelift_environment_variable.stack-writeonly: Refreshing state... [id=stack/managed-stack/STACK_SECRET]
spacelift_mounted_file.stack-secret-file: Refreshing state... [id=stack/managed-stack/stack-secret-password.json]
spacelift_environment_variable.stack-plaintext: Refreshing state... [id=stack/managed-stack/STACK_PUBLIC]
spacelift_context_attachment.managed: Refreshing state... [id=managed-context/01GWJGNFB1M1ARBC9C1FAJ3MVY]
spacelift_policy_attachment.access: Refreshing state... [id=all-of-engineering-gets-read-access/01GWJGNF10KFBJCRYC4NG975GN]
spacelift_policy_attachment.comments_deploy: Refreshing state... [id=deploy-from-pr-comments/01GWNFF3QTWN7Q8S3QCRNJ34T7]
spacelift_mounted_file.stack-plaintext-file: Refreshing state... [id=stack/managed-stack/stack-plaintext-ips.json]
spacelift_policy_attachment.task: Refreshing state... [id=allow-only-safe-commands/01GWJGNF71VSE1E330WWF1N979]
spacelift_policy_attachment.push: Refreshing state... [id=ignore-commits-outside-the-project-root/01GWJGNF7J4KPFKX4VVAHMQN1Y]
spacelift_policy_attachment.plan: Refreshing state... [id=enforce-password-strength/01GWJGNF2QCEHQSVNMM1FZMXDY]
spacelift_mounted_file.context-plaintext-file: Refreshing state... [id=context/managed-context/context-plaintext-file.json]
spacelift_policy_attachment.trigger-self: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01GWJEBYRXRWRFQMW6K9DHCR0T]
spacelift_policy_attachment.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01GWJEBZS1Q9TRE40NHPRZH35C]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spacelift_policy.comments_plan will be created
  + resource "spacelift_policy" "comments_plan" {
      + body     = <<-EOT
            package spacelift
            
            # This policy requires the following permissions on your VCS provider:
            # - Read access to `issues` repository permissions
            # - Subscribe to `issues:comments` event
            # These are likely to be set already. If so, no action is needed.
            #
            # Assuming the above permissions are configured on your VCS application,
            # you can then access pull request comment event data from within your Push policy,
            # and build customizable workflows using this data.
            #
            # Please note that Spacelift will only evaluate comments that begin with`/spacelift`
            # to prevent users from unintended actions against their resources managed by Spacelift.
            # Furthermore, Spacelift only processes event data for new comments,
            # and will not receive event data for edited or deleted comments.
            
            track {
            	input.pull_request.action == "commented"
            	input.pull_request.comment == concat(" ", ["/spacelift", "plan", input.stack.id])
            }
        EOT
      + id       = (known after apply)
      + name     = "plan from pr comments"
      + space_id = (known after apply)
      + type     = "GIT_PUSH"
    }

  # spacelift_policy_attachment.comments_plan will be created
  + resource "spacelift_policy_attachment" "comments_plan" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + stack_id  = "managed-stack"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

[01GVZNDB5B7KMEDC2GG5A0FEY3] Changes are GO
[01GVZNDB5B7KMEDC2GG5A0FEY3] Uploading the list of managed resources...
[01GVZNDB5B7KMEDC2GG5A0FEY3] Please be aware that Run changes calculation includes Terraform output changes.
[01GVZNDB5B7KMEDC2GG5A0FEY3] Resource list upload is GO
[01GVZNDB5B7KMEDC2GG5A0FEY3] Generating JSON representation of the plan...
[01GVZNDB5B7KMEDC2GG5A0FEY3] JSON representation is GO
[01GVZNDB5B7KMEDC2GG5A0FEY3] Loading custom plan policy inputs...
[01GVZNDB5B7KMEDC2GG5A0FEY3] 0 custom plan policy inputs found
[01GVZNDB5B7KMEDC2GG5A0FEY3] No plan policies to evaluate
```

</details>